# !/usr/bin/env python3
# -*- coding:utf-8 -*-
# @Datetime : 2023/10/27 1:07
# @Author   : Fangyang
# @Software : PyCharm

f401_439_balance_sheet_dict = {
    '401专项储备(万元)': '',
    '402结算备付金(万元)': '',
    '403拆出资金(万元)': '',
    '404发放贷款及垫款(万元)(流动资产科目)': '',
    '405衍生金融资产(万元)': '',
    '406应收保费(万元)': '',
    '407应收分保账款(万元)': '',
    '408应收分保合同准备金(万元)': '',
    '409买入返售金融资产(万元)': '',
    '410划分为持有待售的资产(万元)': '',
    '411发放贷款及垫款(万元)(非流动资产科目)': '',
    '412向中央银行借款(万元)': '',
    '413吸收存款及同业存放(万元)': '',
    '414拆入资金(万元)': '',
    '415衍生金融负债(万元)': '',
    '416卖出回购金融资产款(万元)': '',
    '417应付手续费及佣金(万元)': '',
    '418应付分保账款(万元)': '',
    '419保险合同准备金(万元)': '',
    '420代理买卖证券款(万元)': '',
    '421代理承销证券款(万元)': '',
    '422划分为持有待售的负债(万元)': '',
    '423预计负债(万元)': '',
    '424递延收益(万元)': '',  # （流动负债科目，公告此科目的股票较少，大部分公司没有此数据）
    '425其中:优先股(万元)': '',  # (非流动负债科目)
    '426永续债(万元)': '',  # (非流动负债科目)
    '427长期应付职工薪酬(万元)': '',
    '428其中:优先股(万元)': '',  # (所有者权益科目)
    '429永续债(万元)': '',  # (所有者权益科目)
    '430债权投资(万元)': '',
    '431其他债权投资(万元)': '',
    '432其他权益工具投资(万元)': '',
    '433其他非流动金融资产(万元)': '',
    '434合同负债(万元)': '',
    '435合同资产(万元)': '',
    '436其他资产(万元)': '',
    '437应收款项融资(万元)': '',
    '438使用权资产(万元)': '',
    '439租赁负债(万元)': '',
}

if __name__ == '__main__':
    pass
